
class Messages:

    START_MSG = "ارررحب يا سيدي {}.\n\nانا بوت  الرفع الى اليوتيوب انا اقوم برفع الفيديو من التيليجرام الى اليوتيوب بمجرد ربطي بقناتك يا مؤمن .لعرض قائمة المساعدة /help.\n\n مشكور يا سيدي"

    HELP_MSG = [
        ".",
        "اررررحب يا سيدي \n\n اولا قبل كل شيء يجب ان تدرك ان يوتيوب يقوم بمعالجة كل فيديو على حدة واذا وجد فيديو فيه حقوق نشر لن تتمكن من رفعه\n\nاقرأ من خلال جميع الصفحات لمعرفة كيف أعمل.",

        "**كيف يمكنك ان تستخدم البوت **\n\n**الخطوة 1:** __يمكنك السماح لي بالتحميل إلى قناة YouTube الخاصة بك. المزيد عن هذا في صفحات التشغيل.__\n\n**الخطوة الثانية** __انت اعد التوجية اي فيديو من اليوتيوب__\n\n**الخطوة الثالثة:** __أنت ترد__/upload __إلى ملف الفيديو المعاد توجيهه. يمكنك أيضا تحديد بعض العنوان في أمر التحميل، ولكن اختياري على الرغم من ذلك. ستتبع ذلك __`/upload`.__إذا لم يتم إعطاء عنوان، فسيتم استخدام اسم الملف كعنوان__\n\n**الخطوة الرابعة:** __قمت بتنزيل الملف والتحميلات عن بعد إلى قناة YouTube الخاصة بك.__\n\n**الخطوة الخامسة : ** __أرسل لك رابط التحميل الى يوتيوب__",

        "**عليك انشاء قناة جديدة**\n\nلا توجد نقطة في استخدام لي إذا لم يكن لديك قناة YouTube.So تمر بالخطوات المحددة لإنشاء واحدة.\n\n**الخطوة الأولى** __تسجيل الدخول إلى YouTube على جهاز كمبيوتر أو باستخدام الهاتف المحمول.__\n\n**الخطوة 2:** __جرب أي إجراء يتطلب قناة، مثل تحميل مقطع فيديو أو نشر تعليق أو إنشاء قائمة تشغيل.__\n\n**الخطوة الثالثة:** __إذا لم يكن لديك قناة، فسترى مطالبة بإنشاء قناة.__\n\n**الخطوة الأولى:** __تحقق من التفاصيل وتأكيد إنشاء قناة جديدة.__",

        "**Verify your YouTube account**\n\nYoutube take spam and abuse very seriously. So you are asked to verify your Youtube account. Once you've verified your account, you will be able to upload videos longer than 15 minutes. If you haven't verified your account every video uploaded which are longer than 15 minutes will be removed.\n[Verify your Youtube account here.](http://www.youtube.com/verify)\n\n__Remember to verify your project, else your uploads will be kept private.__",

        "**فوضني**\n\nتحتاج إلى إعطائي الوصول إلى مقاطع الفيديو لتحميل مقاطع الفيديو الخاصة بك إلى حساب YouTube الخاص بك. افتح ذلك الرابط المحدد والسماح بالوصول ونسخ التعليمات البرمجية. عد هنا  `/authorise الصق الكود ` وإرسالها.\n\n /authorise"
    ]

    NOT_A_REPLY_MSG = "يرجى الرد على بعض ملف الفيديو.✓"

    NOT_A_MEDIA_MSG = "لم يتم العثور على ملف "+NOT_A_REPLY_MSG

    NOT_A_VALID_MEDIA_MSG = "هذا ليس وسائط فيديو"
    
    DAILY_QOUTA_REACHED = "!يبدو أنك تحاول تحميل أكثر من 6 مقاطع فيديو في اليوم! بشكل افتراضي يوتيوب يسمح فقط بحوالي 6 عمليات تحميل يوميا، لذلك قد يفشل هذا الطلب!"

    PROCESSING = "جاري معالجة الفيديو....."

    NOT_AUTHENTICATED_MSG = "لم تتم المصادقة لتحميل الفيديو إلى أي حساب. أرسل /help للمصادقة"

    NO_AUTH_CODE_MSG = "لا يوجد رمز. يرجى تقديم بعض الأكواد"

    AUTH_SUCCESS_MSG = "قوووة تمت مصادقتي بنجاح✓ \n\n تستاهل كل خير "

    AUTH_FAILED_MSG = "فشلت المصادقة!\nتفاصيل ذالك:{}"
    
    AUTH_DATA_SAVE_SUCCESS = "تم حفظ بيانات المصادقة المعطاة بنجاح!✓"
    
